traces/XXX-guid-dn-get.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:addata="http://schemas.microsoft.com/2008/1/ActiveDirectory/Data" xmlns:ad="http://schemas.microsoft.com/2008/1/ActiveDirectory" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <s:Header>
  <a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2004/09/transfer/Get</a:Action>
  <ad:instance>ldap:389</ad:instance>
  <ad:objectReferenceProperty>&lt;GUID=7020961a-f7eb-4beb-8775-4ca65fe8a465&gt;</ad:objectReferenceProperty>
  <a:MessageID>urn:uuid:615ceeb5-c874-4d35-aca6-27632a596078</a:MessageID>
  <a:ReplyTo>
   <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
  </a:ReplyTo>
  <a:To s:mustUnderstand="1">net.tcp://20.46.226.100:9389/ActiveDirectoryWebServices/Windows/Resource</a:To>
 </s:Header>
 <s:Body>
  <ad:controls>
   <ad:control type="1.2.840.113556.1.4.319" criticality="true">
    <ad:controlValue xsi:type="xsd:base64Binary">MIQAAAAFAgECBAA=</ad:controlValue>
   </ad:control>
   <ad:control type="1.2.840.113556.1.4.801" criticality="true">
    <ad:controlValue xsi:type="xsd:base64Binary">MIQAAAADAgEH</ad:controlValue>
   </ad:control>
  </ad:controls>
 </s:Body>
</s:Envelope>
